Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 2)  0                                            
__________________________________________________________________________________________________
p_mask2d_1 (PMask2D)            (None, 256, 256, 2)  65536       input_1[0][0]                    
__________________________________________________________________________________________________
iff_t2d_1 (IFFT2D)              (None, 256, 256, 1)  0           p_mask2d_1[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 32) 320         iff_t2d_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 32) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 256, 32) 9248        activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 32) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 32) 9248        activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 32) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 32) 9248        activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 32) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 32) 9248        activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 256, 32) 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 256, 256, 32) 9248        activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256, 32) 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 256, 256, 32) 9248        activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 256, 256, 32) 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 256, 256, 32) 9248        activation_7[0][0]               
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 256, 32) 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 256, 32) 9248        activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 256, 32) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 256, 256, 32) 9248        activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 32) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 256, 256, 32) 9248        activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 256, 256, 32) 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 256, 256, 32) 9248        activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 256, 256, 32) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 256, 256, 32) 9248        activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 256, 256, 32) 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 256, 256, 32) 9248        activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 256, 256, 32) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 256, 256, 32) 9248        activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 256, 256, 32) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 256, 256, 32) 9248        activation_15[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 256, 256, 32) 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 256, 256, 32) 9248        activation_16[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 256, 256, 32) 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 256, 256, 32) 9248        activation_17[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 256, 256, 32) 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 256, 32) 9248        activation_18[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 256, 256, 32) 0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 1)  288         activation_19[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 1)  0           conv2d_20[0][0]                  
                                                                 iff_t2d_1[0][0]                  
==================================================================================================
Total params: 232,608
Trainable params: 232,608
Non-trainable params: 0
__________________________________________________________________________________________________
VDSR-20
