Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 2)  0                                            
__________________________________________________________________________________________________
p_mask2d_1 (PMask2D)            (None, 256, 256, 2)  65536       input_1[0][0]                    
__________________________________________________________________________________________________
iff_t2d_1 (IFFT2D)              (None, 256, 256, 1)  0           p_mask2d_1[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 16) 160         iff_t2d_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 16) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 256, 16) 2320        activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 16) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 16) 2320        activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 16) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 16) 2320        activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 16) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 1)  16          activation_4[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 1)  0           conv2d_5[0][0]                   
                                                                 iff_t2d_1[0][0]                  
==================================================================================================
Total params: 72,672
Trainable params: 72,672
Non-trainable params: 0
__________________________________________________________________________________________________
VDSR-5
