vdsr-10
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape           Param #   Mult-Add #  Connected to                        
========================================================================================================================
k_input (InputLayer)                   (None, 256, 256, 2)    0         0                                               
________________________________________________________________________________________________________________________
prob_mask (PMask2D)                    (None, 256, 256, 2)    131072    0           k_input[0][0]                       
________________________________________________________________________________________________________________________
ift (IFFT2D)                           (None, 256, 256, 1)    0         0           prob_mask[0][0]                     
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                      (None, 256, 256, 16)   160       10485760    ift[0][0]                           
________________________________________________________________________________________________________________________
activation_1 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_1[0][0]                      
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_1[0][0]                  
________________________________________________________________________________________________________________________
activation_2 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_2[0][0]                      
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_2[0][0]                  
________________________________________________________________________________________________________________________
activation_3 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_3[0][0]                      
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_3[0][0]                  
________________________________________________________________________________________________________________________
activation_4 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_4[0][0]                      
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_4[0][0]                  
________________________________________________________________________________________________________________________
activation_5 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_5[0][0]                      
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_5[0][0]                  
________________________________________________________________________________________________________________________
activation_6 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_6[0][0]                      
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_6[0][0]                  
________________________________________________________________________________________________________________________
activation_7 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_7[0][0]                      
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_7[0][0]                  
________________________________________________________________________________________________________________________
activation_8 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_8[0][0]                      
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                      (None, 256, 256, 16)   2320      10485760    activation_8[0][0]                  
________________________________________________________________________________________________________________________
activation_9 (Activation)              (None, 256, 256, 16)   0         1048576     conv2d_9[0][0]                      
________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                     (None, 256, 256, 1)    16        65536       activation_9[0][0]                  
________________________________________________________________________________________________________________________
rec (Add)                              (None, 256, 256, 1)    0         65536       conv2d_10[0][0]                     
                                                                                    ift[0][0]                           
========================================================================================================================
Total params: 149,808; Trainable: 84,272; Non-trainable: 65,536
Total mult-add operations: 103,940,096
________________________________________________________________________________________________________________________
